Tekla Open API Reference for Tekla Structures 2025
Mark Constructor
 Constructs a Mark that will be attached to the specified ModelObject upon Insert.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Mark(
	ModelObject modelObject
)
Public Sub New (
	modelObject As ModelObject
)
Parameters
modelObject
Type: Tekla.Structures.Drawing.ModelObject
The model object that the Mark will be attached to.
See Also
Reference
Mark Class
Tekla.Structures.Drawing Namespace